rottenpotatoes/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    id = params[:id] # retrieve movie ID from URI route
    movie = Movie.find(id) # look up movie by unique ID

SELECT  "movies".* FROM "movies" WHERE "movies"."title" = ?  ORDER BY "movies"."id" ASC LIMIT 1  [["title", "George Lucas"]]
---
  def search_directors
    movie = Movie.where(:title => params[:title]).first